jfishpw/TE_PET_ESP32S3/boxpet/sdkconfig.defaults
# BoxPet 默认工程配置（正点原子 ATK-DNESP32S3B0 / ESP32-S3R8）

# ---- 目标芯片 ----
CONFIG_IDF_TARGET="esp32s3"

# ---- CPU：240MHz 双核 ----
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ---- Flash：16MB，QIO 80MHz ----
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ---- PSRAM：八线 80MHz（ESP32-S3R8 板载 8MB） ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# 优先从内部 RAM 分配小对象，大缓冲走 PSRAM
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# ---- FreeRTOS ----
CONFIG_FREERTOS_HZ=1000

# ---- 电源管理：启用 PM（esp_pm_configure 需要，否则返回 ESP_ERR_NOT_SUPPORTED） ----
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y

# ---- LVGL 9（组件 lvgl/lvgl@~9.2） ----
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_MEM_SIZE_KILOBYTES=64
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_USE_FLEX=1
CONFIG_LV_USE_USER_DATA=y
# 启用内置 SimSun CJK 兜底（占位字体使用，正式版用 tools/gen_font.ps1 重生成 ui_font_16.c）
CONFIG_LV_FONT_SIMSUN_16_CJK=y
